Revit 2024 API
Workset.IsVisibleByDefault Property
 Whether the workset is visible by default.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool IsVisibleByDefault { get; }
Visual Basic
Public ReadOnly Property IsVisibleByDefault As Boolean
	Get
Visual C++
public:
property bool IsVisibleByDefault {
	bool get ();
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  WorksetDefaultVisibilitySettings is not applicable to family documents.
See Also
Workset Class
Autodesk.Revit.DB Namespace